{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Truly is \"Jewel of the Upper Wets Side\"”", "text": "Stayed in a king suite for 11 nights and yes it cots us a bit but we were happy with the standard of room, the location and the friendliness of the staff. Our room was on the 20th floor overlooking Broadway and the madhouse of the Fairway Market. Room was quite with no noise evident from the hallway or adjoining rooms. It was great to be able to open windows when we craved fresh rather than heated air. The beds, including the fold out sofa bed, were comfortable and the rooms were cleaned well. Wi-fi access worked like a dream with only one connectivity issue on our first night and this was promptly responded to with a call from the service provider to ensure that all was well. The location close to the 72nd Street subway station is great and the complimentary umbrellas on the drizzly days were greatly appreciated. It is fabulous to have the kitchen with cooking facilities and the access to a whole range of fresh foods directly across the road at Fairway.\nThis is the second time that members of the party have stayed at the Beacon and it will certainly be our hotel of choice for future visits.", "author": {"username": "Papa_Panda", "num_cities": 22, "num_helpful_votes": 12, "num_reviews": 29, "num_type_reviews": 24, "id": "8C0B42FF3C0FA366A21CFD785302A032", "location": "Gold Coast"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147643103, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“My home away from home!”", "text": "On every visit to NYC, the Hotel Beacon is the place we love to stay. So conveniently located to Central Park, Lincoln Center and great local restaurants. The rooms are lovely - beds so comfortable, a great little kitchen and new wizz bang coffee maker. The staff are so accommodating and just love walking across the street to the Fairway supermarket with every imaginable goodies to eat (if you choose not to go out for every meal!)", "author": {"username": "Maureen V", "num_reviews": 2, "num_cities": 2, "id": "E3C85CA9DBBBC77E0DB534ABE93E4713", "location": "Sydney, New South Wales, Australia"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147639004, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Great Stay”", "text": "This is a great property in Midtown. We two different rooms different rooms during our stay. The first room was in the North tower, which was quite inconvenient. You have to go through the conference area to get to the north elevators. \nThe second room was the Andaz Suite. It was nicely appointed room, but the best part about it was the bathroom. From the foot soaking bowl to the bath products, everything about the bathroom was awesome!\nLemon poppy-seed pancakes are must haves at the restaurant. One of the best pancakes ever.", "author": {"username": "vuguru", "num_cities": 12, "num_helpful_votes": 17, "num_reviews": 14, "num_type_reviews": 14, "id": "FB1032DECE1162CB3556D05F278AAFFD", "location": "Houston"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147697954, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Modern Convenience”", "text": "The Andaz is a nice hotel in a central location of Manhattan. The Hyatt has come up with a modern hotel that is both comfortable and convenient. When you arrive you are greeted by friendly \"Hosts\" and they walk you to the check-in desk while offering you a beverage. \nWe had a one bedroom suite that accommodated four people reasonably well. Plenty of closet space, well lit with floor to ceiling windows, and actually quiet!\nThe bathroom was large with a very nice walk-in shower and a built-in bench with unique low spout to wash your feet.\nThe kitchenette was a nice touch with a stocked fridge offering complimentary non-alcoholic beverages and snacks, dishes and utensils, a sink, dishwasher, and a microwave. \nThey have daily Happy Hour(s) where you can get a complimentary decent glass of wine in the modest Lobby Lounge and bring it to your room. The Lobby Lounge has some seating and one table with 8 or so chairs where you can buy food from the adjacent restaurant. One suggestion is to offer selections of cheese and crackers platters to go with that wine. We ordered one that had to be custom made, but it worked well. \nWe didn't eat in the hotel restaurants. The restaurant off the lobby was very pricey for breakfast (+$20 per entree). When you can get a decent breakfast within a block or two of the hotel for under $10, what can I say?\nAs a hotel designer and someone who is very picky about hotels, I will definitely stay there again and I highly recommend it.", "author": {"username": "Hotel-Designer", "num_cities": 5, "num_helpful_votes": 26, "num_reviews": 5, "num_type_reviews": 5, "id": "EC3E275EE7590694889C8C7EE0D13961", "location": "Laguna Beach, CA"}, "date_stayed": "August 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147625723, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Its the best of the Andaz Brand in the US....”", "text": "I have stayed at each of the US Andaz properties, and this one is the best of them all. MUCH better than the West Hollywood property where Brand standards are slowly fading. This is the shining star here in the States.\nMy room (suite) on the 12th floor was fantastic as usual. Perfectly maintained, very comfortable, great bathrooms (best in NYC???). The bathroom is huge, with large shower 'room' and multiple shower heads. Double lavatories flank one wall. Huge....\nTHe bed is always perfect. Televisions in both rooms were perfect for my limited time spend in the suite. Nice desk for work area and in room dining. \nEvery room has a fridge with complimentary soft drinks, snacks, water, sparkling water, milk and juices. Nice touch. Suite has full size refrigerator with icemaker, and also features a microwave, sink and dishwasher drawer....all nicely concealed behind beautiful cabinetry. Really great for a longer stay...\nI do have 2 complaints. First, the elevators. The waits were sometimes ridiculous. 3 elevators serve the main tower with a rather limited number of rooms. THis is a newer hotel, but there is no service elevator. I was continually surprised after waiting for an elevator at how many stops we made for housekeeping to enter with carts, room service carts and trays, etc. How could Hyatt skip a service elevator on this new property? It really stinks at times.....its bad.\nLastly, i have traveled with world and certainly know NYC pricing. Breakfast at the Andaz ranks above almost anything i have ever paid. Apparently, i had a $190.00 breakfast for two the first morning, and $175.00 the second. Eggs for each, coffee, berries. Wow. Of course, i really don't know...as there is no bill. They just deliver it, and leave. Prices are listed in the in-suite menu, but no itemized billing is given. I am 'gifted' with a $75.00 credit for my breakfast as a Diamond member, and i assumed that had not been applied when my bill reflected a 'non itemized' charge for $110 plus for the first night, and slightly less for the second. I was wrong, it had been applied (no way for me to see this). WOW. It certainly isn't worth it.\nI know i sound like one of those guys who complains about pricing, but clearly doesn't know what things cost. Wrong. This one really surprised me, and i have traveled the world for more than 20 years staying in some of the finest hotels in the world. Andaz is great, but it doesn't rank with many that i have had the pleasure of staying with.\nI just had breakfast this morning for 2 at the Four Seasons NYC. It was half the cost....almost. :)\nStay away from room service in my opinion....", "author": {"username": "JamesE339", "num_cities": 34, "num_helpful_votes": 65, "num_reviews": 104, "num_type_reviews": 49, "id": "BA524A238B1171206691A6CC3F28F266", "location": "Saint Louis, Missouri"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147612823, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“One of NYC's Best Hotels, Hands Down”", "text": "Excellent staff (they remembered our names from the moment our family walked in). Our original suite was overbooked, so we ended up in a much nicer suite (no complaints here). Extremely convenient location to Fifth Avenue shopping, restaurants, and subway system. Use the concierge, they worked magic throughout our entire stay. Regardless of whether we needed tickets, or merely a ride, the staff would go out of their way to make sure we were happy. Honestly will have trouble staying at any other hotel in the NYC area. Room service was superb. One of our family members forgot their toothbrush. We called downstairs and within 3 minutes, we had four. \nFor those who stay at this hotel, there's always a chance at a celebrity sighting. Our hotel neighbor happened to be Jamie Foxx, who was staying during his Django Unchained promotional tour.", "author": {"username": "Breakonacloud-com", "num_reviews": 1, "id": "B766E25C73F354AC433EF628F3ACD23B", "location": "Nashville, Tennessee"}, "date_stayed": "December 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 19, 2012", "id": 147762928, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "title": "“Apartment living for less than most 5 stars”", "text": "I stayed at the Setai for 3 nights last week, as my company reserved a block for us. Although the hotel is not near Lincoln Center, which is where we shuttled to every day, I found the hotel to be a true gem. I have stayed at countless hotels in NYC and this is by far the best value. Loved the spacious rooms, modern furnishings and all the free offerings (mini bar, cookies, Internet, pressing). Regina/Chris in sales stayed all night to help coordinate my guests, and Brian/Matt/Louis from the front desk could not have been nicer. The door men were amazing- they assisted our last-minute transport needs with grace, special thank you to Joe, Mike and the security team. My boss is very hard to impress and he has already mentioned he would like to book again next year.", "author": {"username": "French1976", "num_cities": 2, "num_reviews": 3, "num_type_reviews": 3, "id": "0BCA612BCCBA8C065FD9A9C09D27CA53", "location": ""}, "date_stayed": "December 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147681943, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Lovely stay at The Chatwal”", "text": "My husband and I stayed at The Chatwal for 9 nights in April 2012. We booked our rooms via booking.com. We arrived at the hotel very late at night but our check-in was very easy and just like many other reviewers we got upgraded to a suite.\nWe fell in love with the decor. It is just like the photos in the hotel website. The lobby smelled lovely with their signature scent. It was even lovelier when mixed with the fresh coffee smell in the morning. \nBeds were extremely comfortable. Books in the room were a nice touch. We had two bathrooms after our upgrade which we appreciated a lot. The bathrooms were really very chic and the TOTO toilets were something! \nThe housekeeping service was really good with turn-down service.\nWe had drinks at the Lambs Club bar nearly every night with our friends and were very happy with everything. We had dinner at the Lambs Club restaurant downstairs and were very pleased. We did not have breakfast at the hotel as there are a lot of alternatives close by.\nMy husband had a couple of pre-arranged deliveries and the concierge were very helpful with them. We thank Mr Mullins for all his help. We never saw our butler during our 9 night stay, therefore I cannot comment on the butler service, but we did not really need it anyway. \nOverall a great 5-star boutique hotel experience in a very central NYC location.", "author": {"username": "ilkim", "num_cities": 6, "num_helpful_votes": 6, "num_reviews": 8, "num_type_reviews": 7, "id": "BB4AB5B542FDB3E543FE3AEE01F159B3", "location": "Istanbul, Turkey"}, "date_stayed": "April 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 20, 2012", "id": 147769675, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Exclusive boutique hôtel”", "text": "Wonderful boutique hotel located next to Times Square. Subway is two blocks away to all of Manhattan. Numerous classic eateries within walking distance. Bathrooms are ideal with Japanese heated cleansing toilettes.", "author": {"username": "otisokansascity", "num_cities": 15, "num_helpful_votes": 16, "num_reviews": 53, "num_type_reviews": 5, "id": "400210E0882D6A1212C0CC91CC54CE5A", "location": "Kansas City"}, "date_stayed": "December 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 19, 2012", "id": 147722090, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“A Nice Stay for NYC!”", "text": "This hotel is a nice stay for NYC because the rooms are very clean, hotel is very comfortable, and it's in a great location. A few blocks from Herald Square, 34th street shopping, Madison Square Gardens, Penn Station...everything! The staff was very nice and always accommodating. The hotel also has a great view of the Empire State Building in rooms facing 6th Ave. Very cool pic to have if you get lucky!\nI was extremely satisfied with the my two night's stay and would stay again.", "author": {"username": "nikkigfoster", "num_cities": 13, "num_helpful_votes": 6, "num_reviews": 27, "num_type_reviews": 15, "id": "EC6CB11E9DC8761710DDA3CF48DD995F", "location": "Atlanta, Georgia"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 19, 2012", "id": 147759101, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Don't miss this great place!”", "text": "I've stayed at 4 and 5 star hotels all over Manhattan. Over the past year, however, I have returned each time to the Eventi. Wonderful staff, beautiful hotel, incredibly comfortable rooms and for my needs terrific location.", "author": {"username": "DrTiller", "num_reviews": 1, "id": "10BE07B397D5814F9ECCC875B1BA96C9", "location": "Miami Beach, Florida"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 19, 2012", "id": 147735177, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“Perfectly placed delightful hotel”", "text": "Stayed at this hotel for four nights in December 2012. It is perfectly located two blocks from Times Square and one block from Fifth Avenue. We found it a perfect base to explore all Manhattan has to offer. Walking to Central Park took approximately 20 minutes, Times Square was less than 5 minutes away and with close Subway stations access to all of Manhattan is a piece of cake.\nWith regard the hotel itself, we were very happy with out choice. Location aside, the hotel was very clean and well appointed. We had a room on the 11th floor, and after sending the hotel an email prior to our arrival they provided a room with a view of the Chrysler Building, as requested.\nThe room itself was a decent size, tidy bathroom with powerful shower and Molton Brown products. The hotel has two lifts servicing all floor, and we never had to wait for a lift. Both the concierge and the front desk staff were very helpful and courteous, as were the bell boys. A wonderful little touch was the urn in the reception area. In the morning it was full of coffee, with cups available for you to take out with you. And from the afternoon onwards, hot cider was available. \nVery happy with our choice and won't hesitate to return the next time we visit New York.", "author": {"username": "tjbeynon", "num_cities": 9, "num_helpful_votes": 6, "num_reviews": 11, "num_type_reviews": 9, "id": "E530271FD1F16DF31858BD6C7BABD559", "location": "Bristol, United Kingdom"}, "date_stayed": "December 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147689989, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Top Hotel for Break in NYC”", "text": "Hotel was very very good. High quality finish throughout, very comfortable bed, lovely breakfast. Great location. Hotel is a few minutes walk from Rockefeller center and 5th avenue. The subway is right on your door. Only slight critique would be the night life tends to close around 11pm in the immediate area. Very minor issue as we were not in New York to get drunk. Breakfast was basic but perfectly acceptable, lovely fresh continental breakfast, decent coffee, fruit juices, yoghurts. You can eat as much as you like and grab a coffee before you head into New York. The door staff were great, they found us a taxi at rush hour in the rain which in NYC isn't the easiest thing to do.\nThe only problem we had was that our safe was not working when we arrived, (battery was duff) but this was fixed within 20 mins.\nOverall, no complaints, would definitely return again.", "author": {"username": "TurboBailey", "num_reviews": 1, "id": "D7C43AEC4609560C8BE39C6B95EA3137", "location": "UK"}, "date_stayed": "December 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "December 19, 2012", "id": 147758332, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 4.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Great location!”", "text": "We chose the San Carlos based on reviews in T.A and were not disappointed. Location was great, rooms large in good condition, well appointed and staff friendly and helpful. San Carlos was a great location for all the mid and uptown events and attractions we had planned. Close enough for an easy walk to Times Square but far enough away from the crowd and noise. Near to subway for added convenience. The guest rooms are quite large, though the bath is smaller, but we would recommend to friends and stay again on our next NYC visit.", "author": {"username": "tryingfor100", "num_cities": 12, "num_helpful_votes": 8, "num_reviews": 28, "num_type_reviews": 12, "id": "2A66F1FFC377F8CFB078A122A4DDC3E5", "location": "Phoenix, Arizona"}, "date_stayed": "December 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147640456, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Best hotel in New York”", "text": "The service, location, cleanliness were outstanding. Even though the hot water was supposed to be off from 11:00 p.m. to 6:00 a.m. (do not know if it was or not) it did not affect me. It is a great hotel to walk from/to as one gets the full flavor of 5th Avenue.", "author": {"username": "Tom G", "num_reviews": 8, "num_cities": 3, "id": "680AA74DAD6C294713EEF38D09B0625D", "location": "Castle Rock, Colorado"}, "date_stayed": "November 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147677090, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“My favorite classy hotel in New York City”", "text": "This is one of the best and my favorite swanky hotel in New York City. When in NYC this is where I stay. An intimate atmosphere, attentive courteous staff, wonderful location across the street from Central Park. Wonderful bar and restaurants. This is what the Ritz Carlton's try to be. \nIf you've never stayed at the Sherry Netherland I suggest you try it. If you have stayed there, then you must know what I am talking about.", "author": {"username": "Peter G", "num_cities": 18, "num_helpful_votes": 11, "num_reviews": 38, "num_type_reviews": 10, "id": "1599EC7EFF037E47A251CB5F20ACCAA9", "location": "Lake Arrowhead, California, United States"}, "date_stayed": "March 2012", "offering_id": 93559, "num_helpful_votes": 1, "date": "November 25, 2012", "id": 146143543, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Simply perfect”", "text": "When we pulled up at the curb in front of the hotel we were greeted immediately by the bellman. He whisked our luggage into the hotel, the car was taken care of and we were instantly relaxing, enjyoing NYC.", "author": {"username": "NycHappytraveler", "num_cities": 5, "num_helpful_votes": 7, "num_reviews": 12, "num_type_reviews": 6, "id": "6C28078DE49DEF73AA0CB5313C5C69EA", "location": "nyc"}, "date_stayed": "November 2012", "offering_id": 93559, "num_helpful_votes": 1, "date": "November 13, 2012", "id": 145321090, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Excellent location”", "text": "Loved the hotel. Great location - only 2 blocks from 72nd St subway. We had a 1 bedroom suite on the 24th floor and had a wonderful view of the Hudson River and the upper West Side. Lovely subtle green decor and room large for NYC standards. It was great having the living area with the lounge that converted into a double bed for our 2 children (12 and 14). Kitchenette was handy to eat breakfast in. We did cook a few evening meals but were limited with cutlery! The Fairway market across the road from the hotel was fabulous. It had an amazing variety of produce as well as ready cooked meals. Having the laundry on the 7th floor was extremely handy. US$1.75 per load and you could get change from the front reception. The staff and front doormen were all very friendly and helpful. Next to the lift is an info desk where you could get a map of NYC. We used this map for the subway, streets and main attractions as these were all on it. Good bottle shop next door to hotel as well.", "author": {"username": "Erica1103", "num_cities": 2, "num_helpful_votes": 1, "num_reviews": 7, "location": "Christmas Island, Australia", "id": "035080D10D186778123E6A58C11E0608"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147634248, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“All-round fantastic NYC hotel”", "text": "Our first stay on the upper west side and can't say enough good things about the Hotel Beacon. We stayed here based on reviews of family friendly hotels. I'm not sure exactly how they are more family friendly than any other hotel except for the suites and kitchenettes for budget-conscious families. There weren't any special programs for kids, but we did see other families there. For NYC, a nice sized Queen suite gave us everything we needed. Didn't use the kitchen for our overnight stay but definitely would in the future. Rooms were comfortable (ok... a little tight at the foot of the bed but not like some complaints described), the amenities were really appreciated, e.g., free wifi, Keurig coffee service in room, desk area, energy efficient rooms (you put your room card in a device that controls the electricity to save energy while you're out). Lovely bathrooms (although they need a hand towel holder), but really comfortable. We are a family of 3 so the kiddo slept on the pull-out sofa. Room was in good condition-- it appears that shade of green must be the theme, but its nice. The bellman held our luggage after checkout to allow us to stay in the city and not have to worry about our bags. Parking garage is right around the corner -- very close. Viand diner downstairs was OK for dinner -- not great but sufficient. Friendly front desk folks were really helpful -- have breakfast at Bagel Talk not too far away. Very convenient to American Museum of Natural History -- easy to catch a cab or subway. We will definitely stay here again and very happy to recommend.", "author": {"username": "rmfindc", "num_reviews": 8, "num_cities": 2, "id": "412A714D6BF1607A01CC828645DD70AE", "location": "Gaithersburg, Maryland"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147625002, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great hotel in nice area”", "text": "Great room, very big with huge bed! Great location, just one block's walk from 72nd subway then 5 minute ride to Times Square and anywhere you want to go from there!\nWe had a room on the 24th floor so great views of San Remo building and Central Park but building sways ALOT in windy weather, very weird at first!\nVery close to Central Park, check out Cafe Viand for sit down breakfast and Fairway and Levain Bakery for take away breakfast.\nGreat all in all!", "author": {"username": "MiloandMaya", "num_cities": 2, "num_helpful_votes": 3, "num_reviews": 12, "location": "Durham", "id": "72B051F423790BE5F0EF6A9FD23EB77E"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147623184, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great value”", "text": "We stayed at this property in October for a week. Had a king suite, which really was a suite, with sitting room/kitchenette, bedroom and bath. The room was at the rear of the building, which might have been a problem on lower floors (the air shaft was below us); however, we were on the 10th floor and had a decent view to the east, overlooking rooftops. Television in both rooms. The staff was very friendly and helpful. The market across the street was handy for breakfast items and snacks. Only a couple short blocks to the 72nd Street subway.station, where you can pick up the 1,2 and 3 trains. We had previously stayed at a hotel further north, but, nice as it was (with accompanying prices), it cannot compare with the Beacon for value. Definitely recommended.", "author": {"username": "WYbirdwatcher", "num_cities": 40, "num_helpful_votes": 51, "num_reviews": 80, "num_type_reviews": 37, "id": "4DD6C4346D4768ADE814D7A01E956BB7", "location": "Cheyenne"}, "date_stayed": "October 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147622021, "via_mobile": false}
{"ratings": {"service": 3.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Excellent! Will be back:-)”", "text": "This was our first stay at the Andaz. Lovely little hotel with great views of the library. VERY spacious with a HUGE bathroom! The complimentary drinks and snacks were a plus. Very quiet. My only complaint was there was no one to help us with bags or getting a cab. We had quite a bit of luggage and no one was around to open the door at the entrance (which consists of 2 black doors that are also not marked. We wandered around a bit before realizing this WAS the main entrance)!! We needed to get a cab to the train station and were told that none were available and that we should try and walk to Madison Ave to get one! No easy feat with lots of luggage and it was quite the walk. Clearly they should have the means to summon a cab. Hopefully this will be addressed before our next visit!", "author": {"username": "Reba G", "num_reviews": 2, "id": "B20F8339DA7EEBDE0D00D17B3889A49B", "location": "Philadelphia, Pennsylvania", "num_helpful_votes": 2}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 16, 2012", "id": 147577025, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Great Midtown Hotel”", "text": "I was lucky enough to use my Hyatt two free nights to stay at this hotel in early December. Went with my adult daughter and we stayed in a corner room with two twin beds on the ninth floor. It's tough to find good hotels with two beds in a room in NYC so this was a bonus. The room was very quiet. I could not hear anyone from other rooms, the hallway or any street noise. The room has a sleek modern design and was spacious for NYC standards. I loved the bathroom. Being able to get a cold bottle of water at all times was great and snacks in the rooms was a nice touch.\nI also loved the overall vibe of the hotel; small, hip, clean, and friendly. Great artwork. Not warm and cozy though. The seating in the \"lobby\" is not particularly comfortable or inviting. The staff was young and not as experienced as one would find at a five-star hotel but this is not a five-star hotel. They did the best they could to help with restaurant reservations, shopping information and other general information. Easy walk from here to Grand Central Station to hop the subway and cabs easy to find. Loved being across from The New York Pubic Library and Bryant Park. Lovely pop-up stores and ice skating in Bryant Park for the holidays. Beats the craziness of Rockefeller Center in my book. \nThere are a few problems that I believe can be corrected easily. One is the lack of proper lighting in the room, the architect and designers clearly were not thinking of women when they designed the rooms. It is very dark and would be really difficult if you were trying to get ready for a special event. Also there is no drawer space and the closet is minuscule. Not sure how to correct that issue. The other problem is that the beds, at least the twins we slept in, were not very comfortable. Very firm which is fine if you like it that way. All in all though, my memories are of a great stay.", "author": {"username": "beachlsr", "num_cities": 5, "num_helpful_votes": 1, "num_reviews": 9, "num_type_reviews": 4, "id": "851AD5B3B4127850A9292129C156D704", "location": "Hilton Head"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 16, 2012", "id": 147561287, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Stunningly Wonderful!”", "text": "Other hotels in NYC that are space challenged would do well to take note of what Hyatt has done with its two Andaz properties here. Not only is the 5th Avenue property in a great location, but the rooms are wonderfully designed and well appointed and the staff does a great job in terms of customer service. My wife and I arrived at 10am on a Saturday morning and the hotel had been sold out the night before. However, the young lady checked us in quickly and asked for a phone number to call us when our room was ready. We went out to have breakfast and before we were finished she call to let me know that the room was ready. We also loved the complimentary snacks and beverages in the mini frig, as well as in the lounge. The only drawback is that the Internet is painstakingly slow, which is the reaso for the 4 stars. Except for that, the hotel is a 5 all around. Would definitely recommend highly.", "author": {"username": "romadaro", "num_cities": 70, "num_helpful_votes": 156, "num_reviews": 103, "num_type_reviews": 85, "id": "C81AB7D49D98FA410EA191E15F427BEC", "location": "Washington, DC"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 5, "date": "December 16, 2012", "id": 147531970, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“overall wonderful experience”", "text": "I'd never heard of this hotel, but came away a big fan! It is a boutique-style hotel with a European feel; staff always ready to serve and yet laid-back and friendly. The location on Fifth Avenue was walking distance to most of the sights we wanted to see. Perfect. The rooms and bathroom were modern and beautiful...we had a suite with a little kitchen mini-bar set up with complimentary espresso-maker, juices etc. and loved the complimentary wine in the evening! It was such a great stay and such a beautiful hotel and everyone on staff could not have been nicer!!! Thanks for all you did to make our trip to New York special…..we loved every aspect of the Andaz experience. And we will definitely be back!", "author": {"username": "suegilf", "num_cities": 2, "num_helpful_votes": 1, "num_reviews": 2, "location": "Illinois", "id": "366C2E5D586E37518A3FD2B8483A80F2"}, "date_stayed": "November 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147266604, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Excellent hotel, great staff, perfect location”", "text": "Just returned from a 4 day/3 night long weekend in NYC with wife and two (late teenage) sons. We stayed at The Setai and loved it. The rooms are surprisingly large for NY and beautifully appointed. All the staff were outstanding in their courtesy and helpfulness and the location is pretty good too!\nA few tips:\n* We all preferred to take breakfast in our rooms. For some reason it was just a better experience than the restaurant.\n* Do use the concierge for tickets, restaurant and visitor recommendations. Everything they suggested worked perfectly and they enhanced our stay hugely.\n* Don't be afraid to walk and when I say walk I mean stroll. Take your time, look around and you'll be surprised how easy it is to get to places on foot. Empire State Building is insanely close by, Madison Square Garden a short walk beyond that. Rockerfeller Center, Broadway and Times Square make an easy and fun circular route and you can stroll up 5th Avenue to Central Park and beyond quite easily.\n* Subways are a nightmare to find if you're used to the clear signposting in London or Paris but once you done it once or twice you'll get the hang of it. The Setai is no more than a block or two in any direction from the subway.\n* Taxis are a law unto themselves. You have been warned.\nSo....The Setai is just about as good as you can get in Mid-Town and every one of us would go back in an instant if we could. Enjoy!", "author": {"username": "Mikey_B0563", "num_reviews": 4, "id": "897F7031651B0AF7E2D3DA0DE6C9F5DC", "location": "Tonbridge, United Kingdom"}, "date_stayed": "December 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147615694, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Great location for shopping”", "text": "Just had four wonderful nights at this hotel, door men Mike & Joe through to the manager Brian all great people, and really know how to make a guest feel welcome, simply cannot do enough for you. The bar on ground floor great fod and try the local Beer. Unfortunately the bar on the second floor needs to take some lessons on how it's managed as service was awful and staff only became busy and helpful when you asked for the bill - obviously wanting a tip ! This was the only part of the whole hotel that a member of staff did not get a tip !", "author": {"username": "DermotHanafin", "num_reviews": 4, "num_cities": 2, "id": "7F1CB995A20B415891C8D159E77BF45A", "location": ""}, "date_stayed": "December 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 16, 2012", "id": 147558232, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“What a treat!”", "text": "Stayed at The Setai for a special company program. The hotel is beautiful, modern, clean. The rooms are very large for a Manhattan standard, the bathroom is simply astonish. The hotel is on Fifth Avenue, one block from the Empire State Building.", "author": {"username": "Marilya", "num_cities": 5, "num_helpful_votes": 1, "num_reviews": 6, "location": "Raleigh, NC", "id": "31D355E9E630021C6F6AA26AF0B21B2F"}, "date_stayed": "August 2012", "offering_id": 1776857, "num_helpful_votes": 1, "date": "December 15, 2012", "id": 147511667, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Fab location, fab hotel”", "text": "Yes -the hotel if great, the rooms and bathroom are really lovely, the bar is wonderful, the staff are friendly and the service pretty much impeccable. But at nearly £400 a night for a view of other walls and windows, it ain't cheap. I think I got the \"he's booked through Expedia so let's give him a really nice room with a really poor view\" treatment. Not a huge problem as I spent most of the weekend exploring. Their location can't be faulted and nor can the friendliness of the staff and the quality of the service. They also let me have a late checkout on a Sunday afternoon - a sign of a hotel that is truly focused on service in my opinion - my thanks to them. Overall, it's a great place to stay in NY.", "author": {"username": "Mike594", "num_cities": 16, "num_helpful_votes": 7, "num_reviews": 61, "num_type_reviews": 15, "id": "9E8791D169CC0B56544F98A527134F3F", "location": "Richmond-upon-Thames, United Kingdom"}, "date_stayed": "June 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 9, 2012", "id": 147062133, "via_mobile": false}
{"ratings": {"service": 2.0, "cleanliness": 4.0, "overall": 1.0, "value": 1.0, "location": 3.0, "sleep_quality": 2.0, "rooms": 2.0}, "title": "“Somber and noisy”", "text": "A very bad experience. The entrance is narrow and uncomfortable and the doormen don't always open the door for you. You have to walk a few steps and get into a hall which is essentially a bar (so noisy during happy hours that you have to scream to be able to talk to the receptionist). I was given a room on the 9th floor with an annoying noise in the air conditioning system. I changed room and given another one with the same problem and an extremely narrow window looking into a shaft. I was promised a better room the following day but, when I checked the following morning, the lady at the reception said that no room was available and the person I had spoken to was not on duty at the time. I was told to check again later and I responded that if no other room was available I would check out. I got back and, after unpleasant negotiations with a manager, I was promised a better room for the following day. I went to my room, thought about it a few minutes, went back down and said I would check out. At that point I was told that since it was by then past noon I was to pay for the room anyway! Upon my protest, I was allowed to check out without paying for the additional night. Incidentally, the rooms are dark, the furniture is pretentiously stylish but in reality of very poor design and covered with dark brown plastic material. The pool is a joke: the size of four bath tubs! Finally, there is no quiet area where you can just sit down in an armchair and chat with a friend. In my view, the place is grossly overrated.", "author": {"username": "Roberto-Santo", "num_cities": 13, "num_helpful_votes": 73, "num_reviews": 29, "num_type_reviews": 6, "id": "E8836BD65A23C9B4AE2378B6A0FBD8DA", "location": "Milan, Italy"}, "date_stayed": "December 2012", "offering_id": 1641016, "num_helpful_votes": 1, "date": "December 18, 2012", "id": 147693766, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Unique and well done”", "text": "I loved this hotel and couldn’t believe how much money and effort went into the rooms: great bath, built-in cabinetry, automated lighting and drapes, and lots more. Superb service, tasty (but expensive drinks) at the bar, and a terrific Times Square location make the Chatwal hard to beat. Recently it seems room prices have become very high unfortunately.", "author": {"username": "FrankWeho", "num_cities": 23, "num_helpful_votes": 62, "num_reviews": 27, "num_type_reviews": 27, "id": "806A10A82E677C7C839BF3BF8FEFDD49", "location": "Los Angeles"}, "date_stayed": "March 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 16, 2012", "id": 147566654, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 4.0, "value": 4.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Historic Luxury Hotel”", "text": "I stayed at the Chatwel on a layover in NYC. Travelers can always trust a Luxury Collection Hotel to deliver great service, comfortable accomodations and quality products. The Chatwel in Midtown Manahatten is no acception. The staff was very hospital and could not do enough to make sure i was comfortable. I received my normal upgrade as a platinum member and the bell cap enjoyed giving me the tour of the suite room. Features that are becoming standard in high end luxury hotels are all there including the in mirror TV and heated bathroom seats made for a nice touch. \nIf you like midtown and can afford this hotel it is great. Have a meal at the lambs club resturant and gaze at all the historic photo's of days gone by and the starts of Broadway that used to frequent the joint.", "author": {"username": "vandelay09", "num_cities": 9, "num_helpful_votes": 8, "num_reviews": 9, "num_type_reviews": 9, "id": "EAB83334840F4A5E67B63014365C08DF", "location": "spain"}, "date_stayed": "April 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 14, 2012", "id": 147452732, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Amazing first experience in NYC”", "text": "Arrived to Eventi in the evening from Montreal. We were at the 21st floor and had a great view to the ESB (full window from floor to ceiling) and the surroundings. Easy access to everything (we were mostly walking and took the hopon/hopoff tours for further site). Loved the ESB visit but would not recommend the ride (a bit cheesy). Touched with the visit to the 911 memorial site. Best thrill was still the skating time on the rockefeller rink with all the Xmas decoration. \nWould definitively recommend the train ride between Mtl and NYC (take a lot of reading material and games...) and the accomodation in NYC (Eventi has modern and confortable room with all the services including the gym). The staff was helpful and pleasant. Price was reasonnable for NYC.", "author": {"username": "Les_Lanthier", "num_cities": 2, "num_helpful_votes": 1, "num_reviews": 3, "location": "Beaconsfield, Canada", "id": "AADDD41750B01317890FA1289D729E13"}, "date_stayed": "November 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147679428, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "title": "“The ideal getaway”", "text": "I planned a surprise trip to the city for my girlfriend to go see the tree, the rockettes etc. I made the best travel decision I have ever made by choosing the eventi. Not only did they have a bottle of champagne in the room for our big weekend but at every turn they were respectable and completely accommodating. Everyone at the front desk was superb and we were treated like royalty. Service aside our room had very large windows, a rain shower, and was in full view of the Empire State Building.", "author": {"username": "Kyleclem", "num_reviews": 1, "id": "F14F36C885BB72A15E5B1E0B9E69A1D5", "location": ""}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 18, 2012", "id": 147666228, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 4.0, "overall": 4.0, "value": 4.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Modern, minimalist, central hotel”", "text": "We got a reasonable (for NYC) rate ~ $330 with free wi-fi, $15 from mini-bar (which equals about 2 items!). It's a little far from the theatre district, but very central and easy access to the subway. The lobby offers hot coffee/tea/cocoa in the morning and 2 newspapers (WSJ & NYTimes). The fitness area is more than adequate. We preferred quiet to a view, so rooms facing west were very quiet. The rooms do have plenty of outlets for computers, charging phones, etc., and good video connections to the flat screen TV to allow viewing our own video through iPads, computers for those techies. Good environmental controls (we like a cool room), large shower (no tub), and a firm bed. Yes the area is not trendy or cute, but if one can get a good rate this is a very attractive hotel.", "author": {"username": "SE-Explorer", "num_cities": 38, "num_helpful_votes": 207, "num_reviews": 108, "num_type_reviews": 49, "id": "2404E3630B78BB9E8D6583076FBA0742", "location": "Augusta,GA"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 1, "date": "December 16, 2012", "id": 147579169, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 3.0, "location": 2.0, "sleep_quality": 5.0}, "title": "“Nice hotel, poor location”", "text": "The Eventi, a boutique hotel at Sixth Avenue and 30th Street, is part of the Kimpton chain and is typically attractive, with a pleasant, helpful staff. The room was exceptionally quiet. But the neighborhood is pretty dreary -- not unsafe, but unattractive, convenient only to Penn Station/Madison Square Garden, and in the middle of a retail district offering cheap wholesale handbags and jewelry. Next time, I'll choose a better location.", "author": {"username": "Virginia D", "num_reviews": 3, "num_cities": 2, "id": "CA52BC704F2704F07D8CBC18C1026F28", "location": "Philadelphia, Pennsylvania"}, "date_stayed": "November 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 15, 2012", "id": 147501261, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 3.0}, "title": "“Great hotel in great location”", "text": "Stayed at this hotel while in NYC. Hotel is clean, cosy and welcoming with a classic decor, staff are also welcoming and friendly. The location is also hard to beat being close to broadway, the subway and reasonably close to Central Park. Price seemed reasonable for the location but the room was a bit smaller than what we would have liked (couple + 6 yr old) and with three suitcases we had to place one on the floor near the door since there was no where else to put it. Prices for food and services seemed a little steep (not sure how they compare with other hotels in the city) but we found a diner only a few doors down which had good food at good prices. Hotel would suit a couple who only intend to use it as a base and don't intend spending much time there but being in NYC that's not hard to do. A positive experience overall.", "author": {"username": "Elio L", "num_cities": 2, "num_helpful_votes": 2, "num_reviews": 5, "location": "Jakarta", "id": "2F9E7F805508AFE232A1CC3756B96F57"}, "date_stayed": "December 2012", "offering_id": 93396, "num_helpful_votes": 1, "date": "December 16, 2012", "id": 147550229, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great Location”", "text": "Perfect loacation for Theater, Times Square and Radio Music Hall. The place was very clean and the hotel staff was very friendly and helpful. Only complaint, the resturant is over-priced! We paid over $60 for 2 bowls of oatmeal, 2 orders of toast, 1 yougart, coffee and tea. With 20% tip, our breakfast was $78.01. Better choice, The Red Flame on the same block.", "author": {"username": "librablr", "num_reviews": 1, "id": "02A11BB7955AB06151BD287B8936428D", "location": "San Antonio, Texas"}, "date_stayed": "December 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "December 9, 2012", "id": 147058704, "via_mobile": false}
{"ratings": {"service": 2.0, "cleanliness": 3.0, "overall": 3.0, "value": 1.0, "location": 5.0, "sleep_quality": 3.0, "rooms": 2.0}, "title": "“\"It is What it Is\"”", "text": "I arrived around 8:30 p.m., calling ahead to tell the hotel when to expect me and found no doorman and no help with luggage to unload or go up the steps with my bags. A stranger did it for me! Once checked in, an employee decided to show me to the room with me trailing along with my luggage and holding the door to the elevator for him. I finally told him to take the luggage. Once in the room I was told that I was not allowed to adjust the temperature of the room on the thermostat. When I asked about the window heating/AC unit, he proceeded to fiddle with it. I told him to be sure that it was off. He lied and said it was off. It was not off. I later had to get the engineer to turn it completely off as the prior employee had activated a timer that was cycling it on and off. There is no lighting in the closet or for that whole end of the room where I was attempting to unpack. I took the minimum out of my bag for fear of losing the other things in the dark. All wall plugs are completely filled with the hotel's stuff. I had to get down on my hands and knees to find a strip plug underneath the desk for my IPad to charge. Then I found an outlet on the side of the desk for my IPhone to charge. However, to my dismay the next morning I found that when I turned off the desk light, the desk plug also went dead and my phone did NOT charge overnight. The mattress was good and that is why this hotel received three stars instead of two. Now, the shower: I scalded my right arm turning off the shower because there are absolutely NO markings on the shower as where hot, cold or off is. I recommend that you step outside the tub/shower before turning it off and be sure not to have any part of you under the water when turning it off. There is no ventilation in the bathroom. Therefore, not only was the bathroom completely steamed, which ruined my hair, but also the bedroom windows. As to the so-called BAY window in my room: The top half of the windows is completely blacked out by the hotel eliminating half the light coming in the windows. And this room really needs more light. In addition, there are dark brown wooden shutters that cannot be lifted, only tilted that further curtail light entering this room. What a dismal swamp it is. Breakfast: there was an argument about whether or not I was allowed to order the continental breakfast, being first told no and later told yes. And then there was the issue with the eggs. Even when I told them how many minutes to boil the eggs, the cook could not do the eggs even half way cooked to wear I asked. Not a good situation, in my opinion. Sleeping: Although the mattress was comfortable, I had to wear earplugs and play a sound soother to sleep well. When the neighboring room turned on its shower, the water sound screamed and bubbled right at the headboard to my bed. I checked out in the AM for a conference, stored my luggage at the hotel and was allowed to use the gym in the late PM to change my shoes for my trip home in the early evening. I am attempting to be fair and point out the good, too. And finally, when I noted some of the deficiencies to the person who originally escorted me to my room his answer was: \"It is What it is.\" Now that I am safely at home, I can laugh at this most ridiculous interpretation of customer service I have ever heard.", "author": {"username": "9Adventuress", "num_cities": 9, "num_helpful_votes": 26, "num_reviews": 20, "num_type_reviews": 13, "id": "212787FEB4E7A223D38277943BCA6E55", "location": "Cockeysville, Maryland"}, "date_stayed": "December 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "December 7, 2012", "id": 146977843, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“The perfect place”", "text": "Our annual trip to NYC this year I selected the Iroquois - look no further - its so perfect. The friendliest staff ever. Nice size room - very clean - every night a member of staff brings you chocolates and a weather forecast for the next day. Allan the concierge is wonderful - very knowledgeable and gives his honest opinion - everwhere he suggested was great. The location is perfect and doors away is the cutest little diner that serves a great brealfast. Can't wait to go again next year. You can walk to all the great shops on Fifth - and Macy's is also not too far away.", "author": {"username": "Barb G", "num_reviews": 1, "id": "9C31979384B47871E3A84D9926E59022", "location": "Daytona Beach, Florida"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "December 3, 2012", "id": 146678217, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 4.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Perfect for a weekend visit”", "text": "My husband and I stayed here with our good friend while visiting NYC for a Broadway show. The San Carlos hotel is conveniently located to many of the common tourist sites, including Times Square and the Theater District. We were able to walk to most of the places we wanted to see while in NYC. \nThe hotel staff was so nice and accommodating. They let us keep our bags there before and after checkout so we weren't burdened with them while walking the streets and doing some sightseeing. \nThe front desk offered great advice for a restaurant that was only a couple of blocks away from the hotel, and they made the reservation for us.\nWe stayed in a room with two Queen-sized beds, and I will say that the size of the room in general was very large compared to many other NYC hotels. It was very clean and orderly. The beds were very comfortable.\nOverall, this hotel is a great value for the price, great location, wonderful service, and very clean rooms.", "author": {"username": "Allison I", "num_reviews": 1, "id": "4181CB58721207009B44553439F14774", "location": "Baltimore, Maryland"}, "date_stayed": "December 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "December 17, 2012", "id": 147604505, "via_mobile": false}
{"ratings": {"service": 3.0, "cleanliness": 4.0, "overall": 4.0, "value": 3.0, "location": 4.0, "sleep_quality": 4.0}, "title": "“Another nice NYC hotel option”", "text": "I stay in the city each quarter for work and we seem to try a different hotel each time. The San Carlos Hotel had the best rate this time, in the midst of the craziness with the holiday time, and it was a nice place to stay. My initial impression was not positive. I stopped by early to see if I could check in before my meeting and the man at the front desk just seemed to want to chat....and chat....and chat. 10 minutes later, I was able to finally find out a room wasn't ready. No problem, but it didn't need to take that long. When I finally checked in at 5:30, I was given a handicapped room which just had some interesting things in the bathroom. Otherwise, the bed and pillows were very comfortable and I was impressed that the room had a small refrigerator (in addition to the mini bar), microwave, and a drawer that contained plates and silverware. That was a very nice touch. It was quiet and had a comfortable bed so I'd stay again if the price was right!", "author": {"username": "na07950", "num_cities": 18, "num_helpful_votes": 31, "num_reviews": 34, "num_type_reviews": 31, "id": "1BBD0A79D3F59310BF1E27B1A1AAA2C2", "location": "new jersey"}, "date_stayed": "December 2012", "offering_id": 80112, "num_helpful_votes": 1, "date": "December 12, 2012", "id": 147344622, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "title": "“Perfect”", "text": "After alot of trawling for a fab place to stay this was perfect. Location walkable to times square, 5th avenue and close to tube stations. Local people in the area friendly and fab bagel place on 3rd ave and funky rooftop bar directly across the road. The darker style rooms were a blessing for resting and the breakfast is a nice touch that it's free but as been said before don't worry if you miss it. The staff are lovely and helpful and the rooms kept spotless. The beds and pillows were fantastic along with the small bathtub to rest your feet. It was good to have tea/coffee fascilities in the room. We would stay again if we are to come back to NYC. P.S. the Indian restaurant next door is also worth a visit.", "author": {"username": "jaxreadytogo", "num_reviews": 5, "num_cities": 3, "id": "778C6B99E36FBB66D1BFD3DB7127BF03", "location": ""}, "date_stayed": "September 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147174392, "via_mobile": true}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“A REAL GEM IN MID MANHATTAN”", "text": "I stayed this time only one night at the San Carlos hotel. But it was already my fourth stay here. So it starts with a greeted curb side by the doorman who took my suitcase right to the front desk. The check in at the front desk staff was polite and professional but a little bit \"cold\" . The room was again really nice, clean, though unfortunately not the \"suite size I had experienced last times(was realy an upgrade at that time). It had a small sitting room, with all what you needed in your room, refrigerator, coffee, trousers iron,....Excellent location in mid Manhattan, good breakfast for NY standards(all included). Certainly You'll see me back again for business and leisure", "author": {"username": "Johan51", "num_cities": 9, "num_helpful_votes": 4, "num_reviews": 12, "num_type_reviews": 5, "id": "FE92BB08AD3B93A1F0B896B58A0D8A8A", "location": "Belgium"}, "date_stayed": "December 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "December 10, 2012", "id": 147119071, "via_mobile": false}
{"ratings": {"service": 2.0, "cleanliness": 3.0, "overall": 2.0, "value": 1.0, "location": 5.0, "sleep_quality": 3.0, "rooms": 3.0}, "title": "“Great location; mediocre hotel”", "text": "The information about the Sherry-Netherland is very misleading. To begin with, a wide-angle lens was used to photograph the lobby and sitting area, which together are nothing more than a hallway. \nFurthermore, an in-room kitchen is pictured among the hotel photos, which lead me to believe that I could expect this amenity. Perhaps that was naïve of me, but I was not mistaken in my understanding that a microwave oven would be available upon request at the time of booking. Therefore, the derision with which the person on the desk met my query came as a shock. She informed me that since I’d only booked a room and not a suite, I couldn’t expect anything, She went on to ask if I thought they had microwaves just lying around. I requested that this rude X-X look into the matter and, 20 minutes later, someone came with the oven. This was my experience of their much vaunted concierge service. \nAs to it being a “cherished boutique hotel” or a “luxury hotel”, so described on the Sherry-Netherland website, it was shabby and the décor in my room had nothing in particular to recommend it. \nThen there are the elevator attendants, a number of immigrant men who stand around with very little to keep them occupied. They were a nice enough bunch and I’m glad they have work, but they are somewhat redundant. After all, I can press a button in an elevator without any help. \nI’ve seen much better hotels that cost much less money. Who ever gave this place 4 ½ stars?\nYes, I realize that one pays for location and that I rented ‘only’ a room and not a suite but, as a regular visitor to New York, I am never staying at the Sherry- Netherland again.", "author": {"username": "Well_Travelled_TO", "num_cities": 10, "num_helpful_votes": 21, "num_reviews": 25, "num_type_reviews": 9, "id": "1C3058217CAD890E6B27242B025C0B17", "location": "Toronto, Canada"}, "date_stayed": "August 2012", "offering_id": 93559, "num_helpful_votes": 5, "date": "November 3, 2012", "id": 144423921, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“The Best of Everything!!”", "text": "We loved our stay at the Sherry. The accommodations were so wonderful - enormous beautiful room overlooking Central Park and close to the subway and great eating and shopping spots. And the staff was flat out great. It had been a long while since we had been to NYC. They helped us regain our subway prowess, helped with tickets, and they were very accommodating, friendly, and professional. I hope we have an opportunity to stay there again soon!", "author": {"username": "MRB R", "num_reviews": 1, "id": "4BB401C33EDE53071EF70A37FAE59541", "location": "Chicago, Illinois", "num_helpful_votes": 1}, "date_stayed": "October 2012", "offering_id": 93559, "num_helpful_votes": 1, "date": "October 22, 2012", "id": 143479882, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Historic Elegance at NYC's Finest”", "text": "I stayed at the Sherry during my last 4-day business trip to NYC. The location was great - right across from the Plaza Hotel, the Apple Store, and a stone's throw to the beautiful shops on Fifth Avenue. When I arrived, I was greeted by a friendly concierge. The elevators are operated by \"white-glove elevator attendants\", which felt like a little treat every time I went up or down. My room was everything a girl could want on her first business trip to NYC - a dressing room (!!!) with a plush white robe and ample space to hang things, a Keurig coffee maker with unlimited coffee pods, a chandelier, fresh bouquets of flowers, boxes of Godiva chocolates, and a \"welcome\" card from the hotel manager. Every morning I ordered room service from Cipriani's, the restaurant attached to the hotel. The omlette was delicious, and filling out my breakfast form the night before, and hanging it on my door knob, quickly became a ritual. \nOne evening the neighbours were making quite a lot of noise, and I called down to the concierge at midnight. Within 10 minutes someone was upstairs to check on the situation, and shortly thereafter things quieted down. Similarly, when I couldn't get the wifi to work, the concierge offered to send up an IT person to help me figure it out. The staff was attentive, and although they had a bit of that brusque NY attitude (different from what Canadians are typically used to), they were extremely helpful. In the evenings, someone would come to turn down the bed, and leave little Godiva chocolate squares throughout the room. They would tidy up the newspapers and clothes in my room, and make sure it looked warm and cozy for when I got home. I loved it, and would not hesitate to go back again.", "author": {"username": "LifeAbroadHeather", "num_reviews": 12, "num_cities": 3, "id": "E8DD911D4A8E3AECF4C88839882595ED", "location": "Toronto, Canada"}, "date_stayed": "September 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "October 21, 2012", "id": 143381347, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0}, "title": "“Outstanding NYC Hotel”", "text": "My sister and I decided to meet in NYC and chose the Sherry for its excellent location. Rooms are vary large, especially for a NY hotel, and nicely decorated. Room service was expensive but excellent quality. The business center is small but adequate. But what really makes the hotel is the service. Everyone was welcoming and accommodating and went out of their way to help, from the front desk people to the elevator operators to the room service guy.", "author": {"username": "Pamela M", "num_reviews": 1, "id": "5347AE82E82E777411938589FD841AB8", "location": "Palm Beach, Florida"}, "date_stayed": "September 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "October 18, 2012", "id": 143165915, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great hotel in a great neighborhood”", "text": "We go to New York every year and this is where we stay every time. The people who work here are so friendly! The hotel is beautiful and clean. It is always very quiet. I love that there is a market across the street and there are many great places to eat and have drinks nearby!", "author": {"username": "Kathryn B", "num_cities": 2, "num_helpful_votes": 2, "num_reviews": 6, "location": "Philadelphia, Pennsylvania", "id": "95EB37F9B57C64F4FEB2616A39EBFEA3"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 16, 2012", "id": 147567440, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Big rooms - handy location.”", "text": "We stayed in the Hotel Beacon for a week in late October and found it to be a very good hotel.\nThe rooms are very large - we were on the tenth floor - and had a kitchenette/lounge and a bedroom and three walk-in wardrobes !! The staff were very friendly and helpful, and the location was great - handy to central park - a short walk down to the Hudson - the 72nd street train station was just a short walk away... and the best feature of the area was the \"Fairway Market\" - everything you could want in the way of food/groceries/drink is at your fingertips..right across the road and the little restaurant upstairs does a great breakfast (and a really good latte !!!) We used the laundrette in the hotel and it was clean and well lit - what more could you want.\nThis is a \"family\" hotel - nice and quiet with a relaxed air about it. We will definitely stay here again.", "author": {"username": "MelbourneSailor", "num_cities": 3, "num_helpful_votes": 4, "num_reviews": 4, "location": "Melbourne", "id": "062A9A6CCFF95A334A79C4603A61FE3E"}, "date_stayed": "October 2012", "offering_id": 93338, "num_helpful_votes": 1, "date": "December 13, 2012", "id": 147353252, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 4.0, "overall": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "title": "“Great hotel in great location”", "text": "stayed here for 4 nights in December. It is a great hotel, based in the upper East side, 5 minutes walk from central park. The staff were friendly and helpful. We stayed in a 2 bedroom suite which was very affordable and perfect for our family of four. The kitchen was an added bonus as there is a Supermarket across the way where you can get a wide range of food.", "author": {"username": "SAGraham", "num_reviews": 1, "id": "1242FAD3171B3DDBBC23668931DA59FA", "location": ""}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147277030, "via_mobile": true}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Best holiday and best hotel”", "text": "My partner and I stayed here from 6th December - 10th December and had one of the best holidays ever! The beacon hotel was a fantastic place to stay with friendly and polite staff who could not do enough for you.\nThe rooms were modern, spacious and clean and the beds were heaven after a long day walking around manhattan.\nThe area of the hotel was ideal for us as it allowed us to see many of the New York attractions whilst keeping away from the hustle and bustle that many midtown hotels would experience.\nThe hotel itself is about a 10 minute walk from Central Park, however a 30/40 minute walk to many midtown attractions eg. Rockafella centre. I would advise the city bus tour which was $54 dollars per person as it allows you to see all of the main tourist attractions and helps you find your bearings (especially first timers)\nOur overall experience of the beacon hotel and New York as a whole is 10 out of 10. I could not recommend the hotel enough!", "author": {"username": "Lauren E", "num_reviews": 1, "id": "5BDE061662C56F0F142CAFE3CEF4EC9B", "location": "Llantwit Fardre, null, United Kingdom"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147219569, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“Excellent service at difficult times”", "text": "Having stayed there during Huricane Irene (I agree this was 2011) the staff really helped us out on numerous subjects (changing flights, transportation, meals and laundry while the city closed down, etc.). Rooms were excellent and attached which fitted our family needs very well. Location is hard to beat. Would go there again!", "author": {"username": "wollombox", "num_cities": 4, "num_helpful_votes": 1, "num_reviews": 7, "num_type_reviews": 3, "id": "D54F6DF08D89AB767E60EE4900BE56B5", "location": ""}, "date_stayed": "January 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147232546, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Overall great but mixed experience”", "text": "A word to the wise and select your room carefully here. We had a loft room on the 8th floor; half of the room is an \"office\" (it really is an office!) which they did inform us at check in. The room is really only appropriate for a single business traveler. Only one drawer in the room so I used the office to lay out my suitcase and lived out of the that. Bathroom was roomy and the bed very comfortable. Decor is Japanese sensibility meets European minimalism. The controls for the shower were very challenging--no kidding! City noise does filter in--not bad but bring ear plugs just in case this bothers you. For the most part the staff was very helpful and friendly and attentive. The food here is just excellent (breakfast and room service); I would eat here even if i was not staying here. Entrances, dining areas, lounges are not well marked so you have to guess your way around for a bit. Location is excellent: very close to Grand Central Station and tons of eating and shopping options. I would definitely stay here again but would be more discriminating about the choice of room. Lastly, an observation and not a complaint: no holiday decorations to be found here in the midst of December!", "author": {"username": "shep77", "num_cities": 9, "num_helpful_votes": 45, "num_reviews": 21, "num_type_reviews": 10, "id": "9B48FBAB4BDE94E70C9B930C97DFC441", "location": "Terra Linda, California"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 1, "date": "December 9, 2012", "id": 147074342, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Just AMAZING!!!”", "text": "First stay at the Andaz and I was quite impressed. Walk distance to some attractions like Times Square, Empire State Building, Top of the Rock, Grand Central Station etc.... The location is amazing!!\nThe rooms are really modern (minimalist type decor) and very clean, stylish and spacious bathroom, mini bar included except for the liquor. The staff was amazing specially Jenny Rodriguez from concierge who helped us a lot before and after our stay. \nMy only issue was the lack of wardrobe or closet. Other than that highly recommended.\nI'll definitely stay here again.", "author": {"username": "Jhonnyssd", "num_cities": 7, "num_helpful_votes": 3, "num_reviews": 8, "num_type_reviews": 8, "id": "F27424D23185EADC841E88448893CEE4", "location": ""}, "date_stayed": "November 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 7, 2012", "id": 146939936, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“A great stay”", "text": "3 things I like:\n- The best hotel I ever stayed in NYC, the room is very nice, the bed very comfortable, modern and stylish, you can get a good rate if you book well in advance\n- Great location\n- Very friendly staff\n3 things I don't like:\n- no loyalty program\n- no iHome for my iPod\n- the room has no view", "author": {"username": "Lau_traveller", "num_cities": 9, "num_helpful_votes": 10, "num_reviews": 13, "num_type_reviews": 13, "id": "5CAA923D06C9892A80894E6E2428D1D1", "location": "Mexico City, Mexico"}, "date_stayed": "December 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 8, 2012", "id": 146998932, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“Amazing amenities and a great night at the restaurant.”", "text": "The hotel was beautiful and the staff was so friendly and helpful. After a few great recommendations from the concierge and some great meals and nights out we decided to stay in our last night and were delighted to have amazing food, great live jazz and incredible service. Sarah at the bar served us a specialty cocktail from the menu and it's now one of my favorite drinks, I just hope my bartender at home can make them as well as she did!", "author": {"username": "Krisandbiff", "num_reviews": 1, "id": "3EDE444A4965FFA669B4585B0F1F097E", "location": "NYC"}, "date_stayed": "November 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 7, 2012", "id": 146965815, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“LOVE LOVE LOVE!!!”", "text": "I absolutely LOVED this hotel. Very clean, beautiful rooms and a welcoming staff. Special thanks to the reservation manager Deryk. He has been extremely helpful before and throughout our stay. I will definitely come back to this hotel whenever I travel to New york and I will, without any hesitation,book through deryk and I highly recommend anyone who books with this hotel to do the same. Amazing and professional service!! The hotel is a great location, it has spacious rooms and very comfortable beds!! LOVE LOVE LOVE!!", "author": {"username": "Nikki G", "num_reviews": 1, "id": "ADA4B29F08DCEDB2D5AA6BF2BD12BA51", "location": "Montreal, Canada"}, "date_stayed": "November 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 5, 2012", "id": 146835944, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 4.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“lovely boutique hotel”", "text": "For a recent business trip to NY, one of my colleagues recommended this hotel as he always stays here. The location is great if you are a tourist, and happily was within a short walk of the client I was visiting. Having checked in during the evening and out again at 7:30am, I can't really comment on the facilities. However, there was no room service menu in my room, no hotel facilities directory and no breakfast card. This would have annoyed me if I had been staying longer.\nThe room was quite small, but the bathroom was well appointed and the shower was great. I'd stay here again on business, but wouldn't take my husband as he likes to have a bath as well as a shower.", "author": {"username": "AJ0nes", "num_cities": 40, "num_helpful_votes": 43, "num_reviews": 55, "num_type_reviews": 50, "id": "3EEDD1A1669F47EA758E35FA687F8D2B", "location": "Guernsey"}, "date_stayed": "December 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 14, 2012", "id": 147425410, "via_mobile": false}
{"ratings": {"service": 1.0, "cleanliness": 1.0, "overall": 1.0, "value": 1.0, "location": 1.0, "sleep_quality": 1.0, "rooms": 1.0}, "title": "“couldn't get out fast enough”", "text": "delayed check in (computers were down), entered a dark, gloomy room to a horrible musty odor, had a quick lunch in resaurant before a show..........the food was inedible, overly salted and greasy.......requested soymilk for my coffee that curdled as i poured it. the waiter said \"their brand does that, pour it slowly and stir briskly\"......needless to say, i didn't take his advise! besides, the coffee was so stong that it tasted like acid...expected much more from a top chef restaurant, geoffrey zakarian, where are you???? i have never written a review before, i must let you all know that if you choose to stay here you are NOT in for a treat, it's all bad............", "author": {"username": "qual96", "num_reviews": 1, "id": "D54503B8EC8D6806161A0FF91BD286EA", "location": "Merrick, New York", "num_helpful_votes": 2}, "date_stayed": "November 2012", "offering_id": 1641016, "num_helpful_votes": 2, "date": "December 4, 2012", "id": 146756112, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "title": "“Really nice hotel in midtown location”", "text": "My wife and I stayed here for 4 nights during thanksgiving. The hotel is in a great location close to all the shops, theatres, Times Square & restaurants. The food is really good and the rooms very spacious for New York. The bathrooms are fabulous with tv's fitted into the mirrors, heated toilet seats and jucuzzi baths. The rain shower is one of the best I ever had. The beds are very comfortable and the Art Deco style furniture has been well thought out and is of exceptional quality. Give the pool a miss. It's only about 15 ft long. The photos on the website are very flattering. I would definitely return here.", "author": {"username": "IvanL", "num_cities": 13, "num_helpful_votes": 42, "num_reviews": 23, "num_type_reviews": 15, "id": "F673E75A2587F49F713C0E6CF6E4E860", "location": "Limerick"}, "date_stayed": "November 2012", "offering_id": 1641016, "num_helpful_votes": 0, "date": "December 1, 2012", "id": 146552127, "via_mobile": true}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Great Staff”", "text": "Great Staff!!\nWe stayed at the Eventi the first week in December, a particularly hard week to find a hotel in NYC. From the moment we checked in, we made friends with the staff. They were friendly and fun and extra nice to my 12-year old son. They recognized us each time we walked in and out, which made things really great. The great thing that we noticed is that the staff really liked each other and seemed to have a lot of fun working there. We particularly loved the restaurant manager, Tim, who took great care of us and was so funny and attentive to us. \nOh and it was my birthday so they nicely left us a note and some cupcakes in the room, which was great!\nThe room was not super big (but I guess this is NYC). Ours had 2 queen beds and not much room for anything else. The one negative was that it was rather dimly lit even when we turned on every last light, but from what I understand this is a green hotel and they are saving on energy and wattage. However, we would have liked to have the room a bit brighter since there was also a lot of woodwork and dark closet doors which also made the room on the dark side even during the day. The beds were extremely comfortable with nice white fluffy duvet comforters and down pillows. There were a lot of outlets and close to the bed (and located on the nightstands) which were great for charging phones and computers.\nWe were on a high floor with nice views. The rooms with two beds don't face the empire state building, which was a bummer because we hoped to see it from the windows. The hotel is centrally located and we walked from Penn Station and walked to Bryant Park which is beautiful around Christmastime.\nThe 2nd floor restaurant has a glass ceiling and is open to the sky which is beautiful at night and from what I understand the roof retracts which would be awesome on a summer night (which they said they do). \nOverall we had a great stay!", "author": {"username": "burplehippo", "num_cities": 2, "num_helpful_votes": 4, "num_reviews": 7, "location": "Newton, Massachusetts", "id": "061DAD363387C0F7EB1C0B99807F3713"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 15, 2012", "id": 147496256, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Beautiful Hotel.....what more can you ask for....”", "text": "Having stayed at the Ink 48 a few years ago on returning to NYC i figured to try another Kimpton hotel. So full of expectation and a hard act to follow i arrived at the hotel and i was not disappointed. There we a few hiccups but they got resolved in a timely manner by the hotel staff. That was even after i return back to the UK.\nThe hotel itself if in a great location. A couple of blocks from the subway and stones throw from a shopping haven :)\nThe room was big with lots of space, all the things you need in the room, TV, iPod dock and a really comfy bed! I would of taken this home if i could of fitted it in my case :)\nLots of power sockets for charging phones etc.\nStaff are really attentive and friendly and want to ensure that your stay if perfect.\nThe wine hour is always worth a visit even ten after a longs day sightseeing and shopping...", "author": {"username": "schoozie", "num_cities": 9, "num_helpful_votes": 7, "num_reviews": 11, "num_type_reviews": 9, "id": "B17B8F2DBF9D2A9C670F060D9532549C", "location": "Aberdeen, United Kingdom"}, "date_stayed": "November 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147265759, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 3.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Superb Hotel!!”", "text": "Just returned to the UK following a 4 night stay at the Eventi.\nWe were impressed from the moment we walked in - excellent check in, efficient and friendly staff. We went for my 30th birthday and I was given a little present at check in. A big thank you to Neville who sent Champagne, cupcakes and chocolates up as a special treat - what a lovely touch. \nHotel location is fantastic. Very close to the Empire State - fantastic views from the hotel. We requested a room with a view and they didn't disappoint. We were given a room on the top floor with brilliant views across the city. It's around a 10 min walk to Times Square and very close to the Subway station. Lots of nice restaurants and deli's close by. \nWIne hour was marvellous! We were really impressed and the bar and atmosphere was delightful. Just what you need after a long day sightseeing. \nRecommend Tony's restaurant off Times Square if you're looking for a brilliant meal at reasonable prices. The portions are enormous without skimping on quality. The steak special out-did us. Don't think we even ate half!! \nLoved this hotel. Really really impressed and will definitely go back. Oh, and the comfiest bed I have ever ever slept in!!!!", "author": {"username": "Jen C", "num_reviews": 1, "id": "CB305280F19E1630D97E7F46E7B4FACC", "location": "Halifax, United Kingdom"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147236658, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great location and very nice staff”", "text": "I loved my stay at The Iroquois. It was convenient to lots of spots in New York City and the hotel staff was extremely nice and helpful. The elevator in the hotel is a little slow but we stayed on the 3rd floor and took the stairs. They had the best complimentary coffee in the lobby in the morning and the best hot apple cider in the evening. We hung out in the lobby and the library sipping our apple cider in the evening. It was nice to sit and talk to other people staying at the hotel. The hotel had a very home like feel and I would definitely stay there again. New York City is an amazing place. I really wish I lived there.", "author": {"username": "laamarc", "num_reviews": 1, "id": "3DC4E95B8A3E5D881441FF09C5B62788", "location": "Austin, Texas"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "December 1, 2012", "id": 146589286, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 3.0, "rooms": 5.0}, "title": "“Great Location, Clean and Friendly”", "text": "The Iroquois is a beautiful hotel. I chose it because of it's location to Times Square & 5th Avenue and because it also got good reviews here. The staff were very professional and always had a smile. The room was clean and cozy. Our suite, #1000, had the most amazing view of Rockefeller Centre. Also, the windows open nice and wide, which was good because the hotel has that stuffy old hotel air, which gives it its charm but also makes it hard to sleep at night. Of course opening the window makes it louder than normal; I brought earplugs. If you are a light sleeper, BRING earplugs to New York! \nMy husband thought the room was a little small but I thought it was just right. When your on a quick 4 day'er, you don't spend any time in it anyway. It had a TV, dresser draws, a little fridge, a good sized bathtub shower and a desk with chair. Pretty standard. \nUnfortunately, we did not eat in the hotel restaurant but a lady in the elevator told me that it was great. Within a 5 block radius there are plenty of restaurants and Irish Pubs (which happen to be my favourite!), so the hotel ammendities were not that important to me on this trip. There is a good, reasonably priced, family style restaurant at the end of the block called \"the red flame\". Great breakfast diner restaurant for it's price. \nAs I mentioned, the hotel is close to everything. Don't kid yourself though, if you are in New York to see the sights, you will be walking alot. Bring good shoes. The hotel conceirge was fabulous when it came to giving us directions, especially subway lines, so don't worry about having to navigate it all by yourself. \nThumbs up Iroquois... we will be back.", "author": {"username": "Jenaroundtheworld", "num_cities": 7, "num_helpful_votes": 19, "num_reviews": 8, "num_type_reviews": 7, "id": "B33480740B773884A5BA1021E97FD594", "location": "Alberta Canada"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "November 30, 2012", "id": 146510979, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Loved staying here!”", "text": "My husband and I stayed for the long weekend after Thanksgiving. This was our first stay at the Iroquois Hotel. We loved it! The staff was friendly and the room was as described. It was one of the cleanest rooms we have ever stayed at. The bathroom was updated and wonderful. We received a free breakfast with our reservation. It was GREAT! The orange juice was fresh squeezed and delicious. The basket of pastries were fresh and the fruit was freshly cut. Our waiter was very nice and made sure we had everything we needed. We would surely stay here again.", "author": {"username": "Maria1117", "num_cities": 7, "num_helpful_votes": 5, "num_reviews": 14, "num_type_reviews": 4, "id": "F44FD8A5C6C05F1A2560D7558E2E2934", "location": "Peabody, Massachusetts"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "November 28, 2012", "id": 146392323, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Excellent Service, Clean Hotel with a Quiet Elegance”", "text": "I LOVE the San Carlos! The rooms are exceptionally clean with great amenities. The staff was wonderfully attentive without being overbearing. They went the extra mile to make me feel comfortable and give \"idiot proof\" directions to this tourist. The quiet elegance of the hotel was comforting against the hustle and bustle of the city!", "author": {"username": "GrammyJJ", "num_cities": 3, "num_helpful_votes": 3, "num_reviews": 14, "location": "Arlington, TX", "id": "274C380F8392ADDC4BB8984DBD6E9003"}, "date_stayed": "November 2012", "offering_id": 80112, "num_helpful_votes": 2, "date": "November 26, 2012", "id": 146252582, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 4.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“Great value”", "text": "We stayed at the San Carlos for 5 days over Thanksgiving and it was just perfect. The rooms are large for NYC standards. Very easy access, convenient location, clean and confortable rooms. No luxuries but well kept.", "author": {"username": "PTY08", "num_reviews": 2, "num_cities": 2, "id": "A42A4113990C22F9E540FFC1A7F3FB3D", "location": "Panamá"}, "date_stayed": "November 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "November 26, 2012", "id": 146232717, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Location and service”", "text": "My husband, college-age son and I stayed in the executive suite at the San Carlos hotel for the second time this year. We're ex NYers and appreciate the convenience of the location. The executive suite is perfectly designed for 2 or 3 people. It features a pullout sofa in a sitting area as well as a small kitchen. So handy. The linens and appointments are top notch. The rooms are spotless and comfy. The room includes a buffet breakfast. The staff is the best.", "author": {"username": "Sherry B", "num_reviews": 1, "id": "3AC77DB1D382EA9B6B2ACCE5D9B92E5A", "location": ""}, "date_stayed": "November 2012", "offering_id": 80112, "num_helpful_votes": 0, "date": "November 24, 2012", "id": 146114243, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“A Family Hotel”", "text": "I was surprised when the owner of the hotel, presented to me and my family last january. He said, its good that the boss pay attention to you! Effectively, the attention of the hotel is good, the rooms are clear and clean. You feel confortable in the middle of town, next to the train, the museums and the big avenues of New York.", "author": {"username": "José Odalis O", "num_cities": 7, "num_helpful_votes": 3, "num_reviews": 13, "num_type_reviews": 7, "id": "57867662FE1F44518545B6742EF298B6", "location": "Santo Domingo, Dominican Republic"}, "date_stayed": "January 2012", "offering_id": 80112, "num_helpful_votes": 1, "date": "November 14, 2012", "id": 145410390, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Best Home Away from Home in NYC”", "text": "We recently stayed at the Sherry with my husband's parents - for my father in law's 80th birthday. Our suite/rooms were amazinginly spacious for NYC, charming, and comfortable. The hotel was clean, quiet, and the staff were all very friendly and helpful. The hotel offers more of a \"residence\" feel than a standard hotel, and the locations is unbeatable - across the street from Central Park, in the heart of Fifth Avenue shopping, and within walking distance to Rockfeller Center and Times Square (if you enjoy walking). We found the hotel quiet and a terrific place to relax in the evening after exploring the city all day and night. We only used the fitness facility once because the weather is perfect for jogs in Central Park instead, but did find it a bit small and outdated compared to other high end hotels. Room service is available at Cipriani downstairs, and we used it for breakfast, which was good - although the breakfast cutoff hours and staff at Cipriani were not ideal - no fault of the Sherry though, as they are not under the same management and operate independently. We loved our stay at the Sherry overall and hope to be back soon!", "author": {"username": "SophiaFromWindsor", "num_cities": 3, "num_helpful_votes": 2, "num_reviews": 4, "num_type_reviews": 4, "id": "A35B270229DF79EADF4CE59C69654C92", "location": "Windsor, Ont, Canada"}, "date_stayed": "September 2012", "offering_id": 93559, "num_helpful_votes": 1, "date": "October 8, 2012", "id": 142356206, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“NYC at it's finest!”", "text": "Great staff, best location and old world charm. We love the Sherry! Just across the street from the park and if you are up for walking, a walk to and from the theatre, my husband and I did it and we are in our 50's.We will definitely be back!", "author": {"username": "kim b", "num_reviews": 1, "id": "9FBDF67CC35D744221B2D8D896717873", "location": "orlado"}, "date_stayed": "September 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "September 15, 2012", "id": 140325426, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“the wonderful sherry netherland”", "text": "Location location... across the road from central park and walking distance to many attractions, with character and old world charm...thankyou Mr Louis Sherry for founding such a beautiful hotel. Beautiful decor and the rooms are well furbished with antiques and chandeliers. We were lucky enough to be upgraded to a suite...absolutely fabulous. Apartment living in the best locale in town....lounge, dining, kitchen and bedroom with plenty of closet space and a glorious bathroom. Staff were very helpful ...very friendly ....fabulous service. The king room in which we started was also a reasonable size....nice decor with small bathroom...still value for money considering the location ...which is the most outstanding feature and benefit. Central Park to escape to and breathe...with many attractions within near or around the park....strawberry fields, walk trails, the lakes, zoo and gardens plus perimeter shopping and museum mile and much more... subway on the corner....and a fifth avenue address....uptown living at its best. Overall oustanding Sherry Netherland.", "author": {"username": "JJW858", "num_cities": 7, "num_helpful_votes": 14, "num_reviews": 9, "num_type_reviews": 7, "id": "0D302F9486AD564E1951A4E33C425297", "location": "Perth, Australia"}, "date_stayed": "August 2012", "offering_id": 93559, "num_helpful_votes": 1, "date": "September 5, 2012", "id": 139498508, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Luxury close to Empire State Building”", "text": "We stayed in the City One Bedroom Suite during our short trip to NYC. Very much enjoyed the incredibly spacious suite, the beautiful views of NYC and great interior design and architecture of both rooms and hotel. The suite was really very spacious and comfrotable with huge spa bathroom. It was a pleasure to relax there after days spent throughout the city. We really enjoyed the accomodation.\nThe suite includes also small kitchenette. According to the information provided to us at the time of reservation, the refrigerator shall be \"stuffed with selection of non-alcoholic beverages\". And the reality two non sparkling bottles of water. If I wanted to have some coke it was necessary to use room service. It was not overpriced but still very annoying. And the promise given has not been fulfilled.\nThe other negative aspect was that we were not provided with advantages as LHW members except for thenice personal letter from the manager. Usually we receive at least some fruits, uograde, free internet or something...\nThe last negative point was about pre arrival assistance and concierge. We sent some requirements before our arrival but got answer only very late as our email was categorized as spam and the concierge had not chcecked the spam folder. We also had some difficulties with our reservation when in the city and were not able to reach the concierge via phone. We succeeded only after 15 minutes and sixth call. \nOne great tip about the hotel: no checkout time limit. Pretty good!\nDespite small negative issues we very much enjoyed the stay and can honestly recommend the hotel to others.", "author": {"username": "CzechTourist", "num_cities": 23, "num_helpful_votes": 19, "num_reviews": 27, "num_type_reviews": 23, "id": "93204D751F8796489DB9807AE98C2979", "location": "Prague, the Czech Republic"}, "date_stayed": "October 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 4, 2012", "id": 146744546, "via_mobile": false}
{"ratings": {"service": 1.0, "cleanliness": 1.0, "overall": 1.0, "value": 1.0, "location": 1.0, "sleep_quality": 1.0, "rooms": 1.0}, "title": "“Bed Bugs Alert and Major Let Down”", "text": "From the first night we stayed at this hotel, both my husband and myself have been itching like crazy! We stayed an unfortunate four nights at this hotel, and suffered major itching, including a major let down from what we were advised BEFORE booking at The Chatwal! We phoned prior to booking to ensure that the hotel had bathtubs (as our personal preference, we only book with hotels which have bathtubs) - we were advised that EVERY room has a bathtub - excellent, so we booked. We arrived all the way from New Zealand (19 hours of flight-time) at approximately 11:00pm to arrive to a major disappointment. NO BATHTUB! We phoned the desk from our room and were advised \"sorry, there's nothing we can do as all rooms with a bathtub are taken\". We then advised that prior to booking we were advised that ALL ROOMS have a bathtub - \"no sorry, you were told wrong, and there's nothing I can do but you are welcome to leave\". Then my husband went downstairs and spoke to the \"duty manager\" who then finally relented and looked up to see who would be checking out the following morning so we could get a room with a bathtub. We were then promised a room with a bathtub by 12:00 midday, but by the next morning, the woman at the desk advised \"sorry, but they are now checking out at 4:00pm\", so we asked for a refund for the first day since the whole inconvenience had ruined a whole entire travel day (WE had been trying to sort out this mess OURSELVES all night long and the following morning by arranging a room with a bathtub) - their reply \"sorry, there's nothing I can do\" - she didn't even offer any complimentary gestures as a way of saying sorry for the inconvenience caused by this ridiculous hotel! We would have loved to have checked out and moved to another hotel, however, upon such short notice and only arranging three days in New York, time was very restricted. This hotel is PERFECT FOR BACKPACKERS WHO HAVE MONEY! The hotel is so small and running on a strictly cheap budget that there is no doorman in the morning upon check-out. It has been two days since we checked out and yes, we are still itching like crazy! This hotel does NOT guarantee to deliver.", "author": {"username": "Tania B", "num_reviews": 1, "id": "86B83BAFC005AEBC1982CE470CECF220", "location": "Auckland Region, New Zealand", "num_helpful_votes": 3}, "date_stayed": "November 2012", "offering_id": 1641016, "num_helpful_votes": 3, "date": "November 29, 2012", "id": 146438650, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Excellent service”", "text": "My bf and I go to New York quite regularly, and this time choose the Chatwal hotel. We have stayed in the W, Waldorf, Ritz, etc... and the service is excellent. This is truly a boutique hotel with it being a smaller property, but don't let that turn you off as the service is custom tailored. When getting out of the taxi, we had our bags taken care of right away and directed towards the check in counter. We had no problems at check in, and received a complimentary room upgrade which was a pleasant surprise. From that moment on after check in to our departure, all the staff were attentive, and knew our names, or took the time to introduce themselves.\nOne of the most memorable was when in the elevator, and Brandon took the time to talk to my bf about his glasses, and how he had the same one.\nAs previous posters have said, the rooms aren't super big, but this being NYC, this was expected, but the room was gorgeous. Leather closet doors that looked like trunks, an excellent bar area, and a comfortable big bed. The bathroom is amazing. While there was no bathtub, the shower made up for it as it was very large, and the toilet was quite neat with all these japanese style options. The amenities provided were also excellent.\nWe also used the butler service to have our shoes shined, and clothes pressed before dinner.\nHad a chance to use the pool, and gym facilities, which were adequate, but they were working with the space they had.\nThe location was very close to Times Square, so that was convenient, but isolated so the noise and traffic would not affect your stay.\nOur four night stay was quite pleasant, however you get what you pay for, and the Chatwal is pricey. Was it worth it? I would say yes because of the excellent service, and the upgrade. Thank you Chatwal for our excellent stay, and will definitely consider you again for our destination hotel in NYC.", "author": {"username": "Jia24", "num_cities": 3, "num_helpful_votes": 2, "num_reviews": 6, "num_type_reviews": 3, "id": "2B339FA8D855F46E81757D5AD4B3769D", "location": ""}, "date_stayed": "October 2012", "offering_id": 1641016, "num_helpful_votes": 1, "date": "November 28, 2012", "id": 146346783, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Stylish, modern hotel in a great location”", "text": "My wife and I stayed in four hotels in our recent trip across the US and this was our favourite. The location is great and was one of our key reasons for choosing Eventi. We arrived by train into New York Penn and it's only a short 5 min walk to the hotel. Being located on 6th Avenue at 30th Street means you're pretty central for the typical tourist area. The Empire State Building is just around the corner and Times Square is a 10 min stroll north.\nThe hotel itself is very clean and modern in terms of the reception area and the rooms. I was amazed, everything looked brand new. The room was very spacious with a generously proportioned bathroom. The décor made the room feel very special and the bed was extremely comfortable.\nThe staff were very helpful and check-in/out was a very swift process.\nWe paid £148 per room per night which is fairly pricey, but I didn't feel like I'd been short changed. The hotel and location were worth it.\nMy one issue with the hotel was the wi-fi access. Supposedly free, but we never managed to get it working. You have to fill in your details and wait for an email which gives you the necessary login details. Spot the big error here - how can I check my email if I don't have wi-fi?! 5 months later, the email still hasn't arrived...", "author": {"username": "Radioface", "num_cities": 21, "num_helpful_votes": 15, "num_reviews": 30, "num_type_reviews": 20, "id": "844A2D48C83AACAEA31CBFBA027646FF", "location": "Ipswich, Suffolk"}, "date_stayed": "July 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 10, 2012", "id": 147153763, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "title": "“Our home away from home”", "text": "After being in many hotels around the world, there is no other place like the Iroquois! The staff, cleanliness and comfort gets better with every stay. We will definitely choose and recommend others to choose the Iroquois as their Midtown Manhattan hotel! We look forward to staying there again!", "author": {"username": "Chayamushka", "num_cities": 3, "num_helpful_votes": 1, "num_reviews": 5, "num_type_reviews": 5, "id": "13DEB375FDF90BC7243F5F7F8D74FE52", "location": "Brooklyn, New York"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "November 26, 2012", "id": 146239820, "via_mobile": true}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Loved it!”", "text": "Lovely hotel in a great location. The rooms are well appointed and definitely \"cozy\" - small but that's fairly typical for the age and location. The hotel is right in the heart of the theatre district, restaurants and shopping, minutes from Times Square and an easy walk to Central Park. The staff is very welcoming and concierge Vanessa is knowledgeable and helpful.", "author": {"username": "somanyplaces", "num_cities": 17, "num_helpful_votes": 50, "num_reviews": 50, "num_type_reviews": 11, "id": "EE50FED026CF09F69734E9923A65C8D7", "location": "arizona"}, "date_stayed": "November 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "November 26, 2012", "id": 146231229, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Spoiled Rotten in NYC!”", "text": "The Sherry is my home away from home. My business takes me there often, I arrive with chocolates, flowers and a hand written note from the Management. No request is denied, there is a sense of old world service which at most hotels are a thing of the past, well 5 Star Service is alive and well here.", "author": {"username": "Susan G", "num_cities": 5, "num_helpful_votes": 4, "num_reviews": 15, "num_type_reviews": 3, "id": "5877A34A7FB6C823671A76AA69C17AAD", "location": "Healdsburg, California"}, "date_stayed": "August 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "September 4, 2012", "id": 139389202, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 3.0, "rooms": 5.0}, "title": "“Even better than home”", "text": "Excelent hotel, staff, location and accomodations. Big, nice and clean rooms and suites. Expectacular view to Central Park from rooms.\nService was incredible. If you ask something by phone, concierge send someone that arrives to your room in less than two minutes to solve the problem. I had never seen a fast and efficient service.", "author": {"username": "James384", "num_reviews": 2, "num_cities": 2, "id": "4BB57082D20CEB709C55AF1A38FD6BEB", "location": "Santiago, chile"}, "date_stayed": "August 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "August 31, 2012", "id": 139013528, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“one of the best hotels in new york city”", "text": "Was a experience to remember. Great place to stay and place to be for a visit while in new york city... ,ALSO look forward to going back in the near future and making the sherry netherlands hotel my honeymoon stay...BE...The sherry netherlands hotel and staff made me and my lady feel very welcome to be there....Thank you all again", "author": {"username": "Kenny B", "num_reviews": 1, "id": "46C6569704E45A0583C96D4DB0C601CE", "location": "Astoria, New York, United States"}, "date_stayed": "August 2012", "offering_id": 93559, "num_helpful_votes": 0, "date": "August 27, 2012", "id": 138602833, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Hurricane Sandy”", "text": "Due to a lack of electric power from hurricane Sandy and the NY Marathon falling on the same weekend we couldn't get a room at The Plaza, Pierre, Regent, Essex House etc. My wife found a room at the San Carlos Hotel in Midtown with only one night available. We loved it. The room was clean, bright and more than ample.\nThey had a nice buffet breakfast included.\nGreat staff", "author": {"username": "mrwarz", "num_cities": 3, "num_helpful_votes": 5, "num_reviews": 3, "num_type_reviews": 3, "id": "D9949B9443D4AA560DF648DBD7DA652F", "location": "Jersey Shore"}, "date_stayed": "November 2012", "offering_id": 80112, "num_helpful_votes": 2, "date": "November 7, 2012", "id": 144856877, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Girls NYC adventure. With gatecrasher Sandy”", "text": "After 2yrs planning 3 friends and I left the husbands and kids at home in Ireland and headed to NYC for 4 nights of relaxation, sightseeing and shopping. We arrived Sat 27th and Sandy arrived Monday 29th so our NYC adventure became somewhat curtailed. Thanks to all the staff at San Carlos. We ended up staying for 3 extra nights (at standrad rate - no profitering, unlike stories we heard from other weary travellers!!!) and enjoyed all NYC has to offer before we departed. The rooms are very spacious and spotless. The suite was great for 4 ladies. Highly recommended.", "author": {"username": "JMCG41", "num_reviews": 1, "id": "4454C9A05D90AECF88DE0B2EB0197ED9", "location": "Belfast, Northern Ireland, United Kingdom", "num_helpful_votes": 1}, "date_stayed": "October 2012", "offering_id": 80112, "num_helpful_votes": 1, "date": "November 7, 2012", "id": 144839148, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Amazing Hotel !”", "text": "I recently stayed at this hotel with a friend of mine for four nights when we visited NYC. We weren't sure what to expect as we went off of reviews from here and viewed picturs uploaded by others on this website. When we arrived the staff was very welcoming and took our bags up to our room. The room and bathroom was very small; however, this was to be expected for NYC. The location was amazing - it was a 4 min walk to Times Square. The staff was very friendly and answered any questions we had including the fastest way to get to a particular place. They also provided us extra pillows and towels when we requested them and band-aids for my friend who got blisters from walking all day. The check-in and check-out was a very smooth process and did not take long at all ! When we return to NYC, we will be staying here again!!", "author": {"username": "Aubree25", "num_reviews": 1, "id": "2E201EE8885392BDB2175E52ECC5C28E", "location": "London, Canada"}, "date_stayed": "September 2012", "offering_id": 93396, "num_helpful_votes": 0, "date": "November 25, 2012", "id": 146180106, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Great Hospitality and Atmosphere”", "text": "My husband and I had a wonderful stay at Eventi in New York. It was a great location,and the staff is so professional and met our every wish. The room is so comfortable from the bed to the little details. Love every detail, the lights, the outlets for phones and computers that are strategically placed and suprisingly we didn't hear the NY noise like many other hotels. The wine hour was a nice touch...can't wait to stay there again!", "author": {"username": "Jean H", "num_reviews": 1, "id": "83D4DC427EA9F312D9DE988A9FD1C486", "location": "Downingtown, Pennsylvania"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 8, 2012", "id": 147022232, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Great location and very friendly staff.”", "text": "We stayed here for two nights during a business trip. The front desk and hospitality staff were very welcoming. The room was a little small, but not unexpected in NY. Sometimes it is the little things, I loved the plugs in the night stands for my phone!! Very clean, nice television, very comfy beds with tons of pillows. I would stay here again.", "author": {"username": "SherrieARC", "num_cities": 25, "num_helpful_votes": 26, "num_reviews": 47, "num_type_reviews": 9, "id": "0C8BAA7C3A8A97C443F54E7E62FABAC6", "location": "Elon College, North Carolina"}, "date_stayed": "December 2012", "offering_id": 1456560, "num_helpful_votes": 0, "date": "December 7, 2012", "id": 146971604, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Retro Cool”", "text": "Took a Veterans Day weekend trip to The Chatwal for our anniversary. We used our Starwood points for the room. Little pricey, but it's a nifty hotel. The lobby area is small, but with gorgeous Art Deco. Interior of The Lambs Club restaurant is also really lovely. It's right off Times Square, so location is good for most things.\nRooms at the Chatwal aren't super big, but this is NYC and this is a retro location, so I didn't expect massive space. What they lack in size, they make up for in appointments. The rooms are done up kind of like I'd imagine a 1920s cruise ship. Leather doors with leather handles, kind of like old time steamer trunks. Lots of cubbies and efficient use of space. Cool bar. Bathrooms are awesome. As others have mentioned, the toilets have an unreal number of functions--bidet, seat warmer, air dry. Too many functions, really, but fun when you're on vacation.\nOur room was facing the alley, so nothing great on the view. But the room was nice enough that it didn't matter. Wish the bed had been a bit more comfy and higher off the floor--all the beds seemed very, very low--but overall I was pretty happy with the space. Service was great as well. Free shoe shine and you have a butler who can handle things like pressing your suit or dress for dinner.\nDid have a bad situation, which highlights the excellence of the service. We'd been given a room with a connecting door. Unfortunately, next door were three single guys having a weekend in the city and the noise was unreal. Like they were standing right next to you talking in your ear while you were trying to sleep. So we got to participate when they got room service at 2 a.m. when they got up at 8:30 and then again when the maids came in to clean at 9. After the first night, we complained to the desk and they gave us a new room.\nWe went out for the day and when we came back, they'd packed all of our things and moved them for us. And they were thorough--they even found the charger my husband had left plugged into the wall. So have to give them credit for the assist.\nThat said, if you walk into your room and there's a connecting door and you're not with the people staying in the next room, immediately get a new one. You will hear everything.\nOverall I enjoyed it. Honestly, I was probably expecting a little more for the level, so I wouldn't say it exceeded my expectations, but it was very nice. My gold status didn't really get us much of anything, so can't say Starwood helped much, other than to use the points. It's not inexpensive. It was 30,000 points plus per night, and more than $700 if we'd paid out of pocket. Not out of sync for this level in NYC, but the St. Regis was on the same point level and I can't say I think it's better than that. \nBottom line--if you're looking for something retro and cool, it's great. If you need something more modern or a lot of space, probably not for you.", "author": {"username": "dagnyt", "num_cities": 10, "num_helpful_votes": 43, "num_reviews": 15, "num_type_reviews": 12, "id": "2460DAC350A498A3DB494E1FE485F32C", "location": "Tallahassee, Florida"}, "date_stayed": "November 2012", "offering_id": 1641016, "num_helpful_votes": 1, "date": "November 20, 2012", "id": 145838274, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“A Great NY Experience”", "text": "Our first trip to NY City in a few years and the first time we stayed at the Chatwal which we decided to stay in due to it's proximity to Broadway and a friend's recommendation.\nThe hotel does not have a grand entrance, however once inside it's art deco style embraces you. Our room was upgraded on the basis we had to wait 10 minutes to check in, it was not expected but welcome all the same as were the complimentary cocktails. The room was superb and I cannot fault it. The same with the bathroom. The rain shower is the best I have experienced, and my wife just loved the Toto toilet, which shall we say possesses many added extra's to make your bathroom experience more entertaining!\nFinally, the location, we booked to see a broadway show and were there in less than two minutes, it's right in the heart of Times Square which offered numerous choices of eating and drinking establishments.\nThe Chatwal is not cheap but worth every penny.", "author": {"username": "AvidTraveler12", "num_cities": 33, "num_helpful_votes": 242, "num_reviews": 175, "num_type_reviews": 22, "id": "0D7D3A6D02F09ECFADA86460A9BEFF17", "location": "Dubai, United Arab Emirates"}, "date_stayed": "October 2012", "offering_id": 1641016, "num_helpful_votes": 3, "date": "November 20, 2012", "id": 145798763, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“AMAZING EXPERIENCE, SERVICE AND STAFF!! CLEAN!! CLASSY!!”", "text": "AMAZING HOTEL!! This is the 3RD time i stay here!! The reservation manager DERYK is so pleasant and kind and helpful!! He is one of the many reasons that i will be loyal to this hotel!! If you are planning a vacation to new york book through him!! The bathrooms are huge and clean and the beds are extremely comfortable! Very helpful staff who are always there to help!! definitely the only hotel i would stay at in new york!!", "author": {"username": "Steph E", "num_reviews": 1, "id": "0896A1B44F74085959081A5822AD0A59", "location": "Westmount, Quebec, Canada"}, "date_stayed": "November 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 3, 2012", "id": 146721011, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 4.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“AMAZING PLACE”", "text": "I arrived to the hotel greeted by warm welcoming employees, My personal assistant Helped me what whatever i need, and when i say whatever i mean whatever. They helped me get reservations at places that took months to get in on. I also made a reservation for my husband and i at the spa in the hotel. one of the BEST spas i have ever been to. being that my husband travels a lot. The staff at the spa Jason and Cynthia were welcoming relaxing made us feel like we made the right choice just off the welcome we got. They did not rush us to fill out out paper work or to the treatment, they made us a glass of wine just for it being our Anniversary a few weeks ago, to me that was amazing i would never expect such professionalism and kindness out of a spa before. After our treatments we paid and they again wished us a happy Anniversary and walked us down to the elevator pushed the button and contented to talk to us, going above and beyond to make us feel at home here at the hotel. i would stay at this hotel a million times and i will be recommending it to my friends and family. Thank you so much Setai", "author": {"username": "Anita S", "num_reviews": 1, "id": "A54025EA158A0D9BCD979D0A4657250A", "location": "San Diego, California"}, "date_stayed": "September 2012", "offering_id": 1776857, "num_helpful_votes": 0, "date": "December 3, 2012", "id": 146682872, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“four adults, one infant, one \"Minnie\" poodle in a 2 bedroom suite”", "text": "We stayed here in May 2011 to attend a friend's wedding. My husband and I took a red eye from SFO and we planned on meeting my sister, brother in law, 5 month old nephew, and their dog who had driven up from VA. We stayed in a two bedroom suite with views of the library, Bryant Park, Empire State Building, and a glimpse of Times Square. The location was superb. We were within walking distance to my favorite NYC places including Ktown, Central Park, and 5th Ave. \nOur suite was HUGE especially for NYC. The bathrooms are sleek with C.O. Bigelow toiletries. There was a kitchenette incluing a mini dishwasher. All non-alcoholic drinks were included in the room rate. Since my husband is Hyatt diamond, breakfast for all four adults was included in the rate and we were able to have it delivered to our suite through room service. The breakfast came from the restaurant downstairs - the shop and everything was delicious. \nThe hotel is trendy and modern and yet it feels cozy. The service was great.", "author": {"username": "FIFItheWorldTraveler", "num_cities": 12, "num_helpful_votes": 12, "num_reviews": 14, "num_type_reviews": 14, "id": "2B037FEF48446F3CC6D47C8BE10F0AC7", "location": "San Francisco"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 6, 2012", "id": 146918317, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 3.0, "overall": 3.0, "value": 3.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 3.0}, "title": "“Contemporary Discomfort”", "text": "This hotel features beautiful bathrooms and stylish, trendy decor. Unfortunately, the rooms are uncomfortably furnished and almost useless to work or read in. The furnishings (chairs and desk) are at a level about 4 inches below normal. There is no comfortable chair or sofa on which to sit; when in your room, only the bed offers any true respite. Televisions are wall mounted flat screens, but set only about four feet off the ground, so unless you are in bed, an adult generally would look down to the screen. All in all, very strange and completely unnecessary. Finally, in the beautiful bath, black mold was evident in the tile grout and was also on the shower wall, although not obvious since it was obscured by the coloration of the tile.", "author": {"username": "vtlinck", "num_cities": 4, "num_helpful_votes": 7, "num_reviews": 4, "num_type_reviews": 4, "id": "DDEF2D8AB681DFB4CD58C007244DD5C2", "location": "Sugar Land, TX"}, "date_stayed": "December 2012", "offering_id": 1762573, "num_helpful_votes": 1, "date": "December 6, 2012", "id": 146872434, "via_mobile": false}
{"ratings": {"service": 3.0, "cleanliness": 4.0, "overall": 4.0, "value": 3.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 5.0}, "title": "“Comfort @ Andaz 5th Avenue”", "text": "Planned a long weekend last week in NYC; Arrived in hectic rush hour from JFK at the Andaz 5th avenue and were welcomed in their slick hotel lobby and immediately upgraded upon check-in to a two bedroom suite, with separate bathrooms and a livingroom, which allowed for discrete privacy for all three travellers;\nAgree with the considered 5* service level, hotel key amenities are:\n- Cool and chic design\n- Central design @ 5th avenue opposite Library and 2 blocks from Grand Central\n- Nice restaurant with excellent breakfast á la carte menu\n- Bar downstairs with good vibe for cocktails and tapas style food\n- Small gym but with modern equipment", "author": {"username": "Roland014", "num_cities": 2, "num_helpful_votes": 1, "num_reviews": 2, "location": "Amsterdam, The Netherlands", "id": "990EDD5095FDB123D4CDFA5BBBBE0779"}, "date_stayed": "November 2012", "offering_id": 1762573, "num_helpful_votes": 0, "date": "December 5, 2012", "id": 146839909, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 4.0, "overall": 5.0, "value": 4.0, "location": 4.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Great location, good value”", "text": "We enjoyed our stay at Hotel Beacon. We got a 1 BR suite, which worked out fine for our group of 3 on a girls' trip. (There is a fold out couch in the living room). It was nice to have a refrigerator to store cold drinks, leftovers and breakfast items. The staff was very nice and responded quickly to requests for more towels, etc. The only issue we had was that one night there was a late concert going on at the Beacon Theater next door and from our room we could hear the music. \nThe location is great....we liked being in a \"neighborhood\" and love the tree-lined side streets and brownstone homes nearby. In just a few blocks of walking (less than 5 minutes) you can be at a subway stop. I would definitely recommend Hotel Beacon for all kinds of travelers.", "author": {"username": "Zoecat601", "num_cities": 4, "num_helpful_votes": 5, "num_reviews": 6, "num_type_reviews": 4, "id": "D76025FEE92AE98C83936BF76EE1CAA7", "location": "Birmingham, Alabama"}, "date_stayed": "December 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 11, 2012", "id": 147200077, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 4.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Lovely rooms”", "text": "Great hotel for New York. Kitchenette is a godsend and whilst small has everything you need. Our room was on 21st floor, and we compromised some space and bed size (we had initially been allocated 11th fl) for a fantastic view; and far more natural light. Room was cleaned daily and you can ask for extra kitchen things, like sharp knife (!!) wine glasses etc. Supermarket is just over the road.\nWe arrived on Thanksgiving and got excellent service from the check in manager and Kenny at the door was great. Other times it was not quite so good, or pleasant. And the information given out by the concierge regarding half tix booth downtown was incorrect. We ended up wasting half a day travelling downtown (which was closed due to Sandy) as a result. Not happy at all. \nOtherwise, all good - easy to get to subway, walk to Central Park and MNH, $10 cab ride to/from pretty much all the other major attractions.", "author": {"username": "Janine2511", "num_cities": 3, "num_reviews": 3, "num_type_reviews": 3, "id": "9CA15141F2487842873FEA5F58067536", "location": "Sydney, Australia"}, "date_stayed": "November 2012", "offering_id": 93338, "num_helpful_votes": 0, "date": "December 9, 2012", "id": 147036699, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 4.0}, "title": "“Awesome hotel :)”", "text": "My best friend and I went to NYC in August last year and spent 2 weeks at Hotel Beacon. We booked the 1 bedroom, 2 double bed room. The room was HUGE, very clean and we had a great view. Our room had a coffee machine, which was re-stocked with coffee pods and creamer every day by the cleaning staff. There is also a great restaurant next door, the owner was very nice and makes an effort to greet his customers (and remembers the ones who go back multiple times like us!). \nMy only complaints:\n1. (I don't know if this was an issue with our room only) - The bathroom didn't have any sort of ventilation, so we had to shower with the door open or the whole room would steam up. This wasn't a problem for us and wouldn't really be a problem for a couple, but could get awkward if you were staying with your boss on a business trip!\n2. No complimentary wireless internet - For the amount of money we paid, it would have been nice to have access to wifi, even if we had to sit in the lobby or something to get it. They have the option of around $10 per day to get wireless in the room, or you could go to the computer room which only had 2 computers in it (and it was always full). \nOverall - A great hotel. The staff were extremely friendly (especially the door men, who would happily stand and have a chat while we were waiting for a taxi), the room was lovely and it's in a great spot (walking distance to Times Square or easy access to the subway for those who don't want to walk). Would definitely recommend it to friends and family :)", "author": {"username": "Emmaline1234", "num_reviews": 1, "id": "486A73DC572C89FD062DE2E8FE9560A8", "location": "Melbourne, Australia", "num_helpful_votes": 1}, "date_stayed": "January 2012", "offering_id": 93338, "num_helpful_votes": 1, "date": "December 8, 2012", "id": 147026010, "via_mobile": false}
{"ratings": {"service": 4.0, "cleanliness": 5.0, "overall": 4.0, "value": 5.0, "location": 5.0, "sleep_quality": 4.0, "rooms": 4.0}, "title": "“Better Than Expected”", "text": "Our room was bigger than expected and quiet. We loved the bed linens and the soaps and other toiletries which were of high quality. Appreciated the free bottled water. Friendly people. Great location in Midtown.", "author": {"username": "", "id": "", "location": ""}, "date_stayed": "December 2012", "offering_id": 239853, "num_helpful_votes": 0, "date": "December 14, 2012", "id": 147456471, "via_mobile": false}
{"ratings": {"service": 5.0, "cleanliness": 5.0, "overall": 5.0, "value": 5.0, "location": 5.0, "sleep_quality": 5.0, "rooms": 5.0}, "title": "“Completely Impressed; Enjoy my stay!”", "text": "I was in Houston on business and stayed at this Best Western from 12/3-12/7; best experience on business travel I have ever had. The staff at this location is phenomenal and extremely personable. This Best Western location exceeded any expectations that I had. If I'm ever in Houston again I will be staying at this location!", "author": {"username": "vicky m", "num_reviews": 1, "id": "45E32579D5D850D39780049BBEB8F48C", "location": "Downers"}, "date_stayed": "December 2012", "offering_id": 239853, "num_helpful_votes": 0, "date": "December 14, 2012", "id": 147434487, "via_mobile": false}
